Examples/StateDiagram/Exports/javascript.dot
digraph {
  label="Download.state";
  labelloc=t;
  rankdir=TB;
  bgcolor="white";
  fontname="Helvetica";
  fontsize=12;
  node [fontname="Helvetica" fontsize=12];
  edge [fontname="Helvetica" fontsize=10];
  "__initial" [shape=circle style=filled fillcolor="#333333" width=0.3 label=""];
  "state__idle_" [shape=Mrecord style=filled fillcolor="#f5f5f5" color="#333333" fontcolor="#333333" label=""idle""];
  "state__requested_" [shape=Mrecord style=filled fillcolor="#f5f5f5" color="#333333" fontcolor="#333333" label=""requested""];
  "state__downloading_" [shape=Mrecord style=filled fillcolor="#f5f5f5" color="#333333" fontcolor="#333333" label=""downloading""];
  "state__verifying_" [shape=Mrecord style=filled fillcolor="#f5f5f5" color="#333333" fontcolor="#333333" label=""verifying""];
  "state__finished_" [shape=Mrecord style=filled fillcolor="#f5f5f5" color="#333333" fontcolor="#333333" label=""finished""];
  "state__failed_" [shape=Mrecord style=filled fillcolor="#f5f5f5" color="#333333" fontcolor="#333333" label=""failed""];
  "__initial" -> "state__idle_" [color="#666666"];
  "__initial" -> "state__requested_" [color="#666666" label="run()"];
  "state__requested_" -> "state__downloading_" [color="#666666" label="run()"];
  "state__downloading_" -> "state__verifying_" [color="#666666" label="run()"];
  "state__verifying_" -> "state__finished_" [color="#666666" label="run()"];
  "__initial" -> "state__failed_" [color="#666666" label="fail()"];
}
